FIND_FRIEND_BUTTON_VALUE = '🐕 Знайти друга'
HELP_SHELTER_BUTTON_VALUE = '❤️ Допомогти притулку'
USEFUL_INFO_BUTTON_VALUE = '📚 Корисна інформація'
TELL_STORY_BUTTON_VALUE = '💬 Розповісти свою історію'
ABOUT_US_BUTTON_VALUE = '👋 Про нас'
CONTACTS_BUTTON_VALUE = '📞 Контакти'

MAIN_SCREEN_BUTTONS = (
    FIND_FRIEND_BUTTON_VALUE,
    HELP_SHELTER_BUTTON_VALUE,
    TELL_STORY_BUTTON_VALUE,
    ABOUT_US_BUTTON_VALUE,
    CONTACTS_BUTTON_VALUE,
    USEFUL_INFO_BUTTON_VALUE,
)

CATALOG_BUTTON_VALUE = '🗂 Каталог'
FORM_BUTTON_VALUE = '❓Анкета'
RETURN_BUTTON_VALUE = '⏪ Повернутись назад'

FIND_FRIEND_BUTTONS = (
    CATALOG_BUTTON_VALUE,
    FORM_BUTTON_VALUE,
    RETURN_BUTTON_VALUE,
)

MAKE_DONATION_BUTTON_VALUE = '❤️💵 Зробити внесок'
HELP_WITH_PETFOOD_BUTTON_VALUE = '🥩 Допомогти кормом'

HELP_SHELTER_BUTTONS = (
    MAKE_DONATION_BUTTON_VALUE,
    HELP_WITH_PETFOOD_BUTTON_VALUE,
    RETURN_BUTTON_VALUE,
)

HEALT_BUTTON_VALUE = "👩‍⚕️ Здоров'я"
GOODS_FOR_DOGS_BUTTON_VALUE = '🛍 Товари для собак'
EDUCATION_AND_LEISURE_BUTTON_VALUE = '🧸 Виховання і досуг'
ABOUT_PUPPIES_BUTTON_VALUE = '🐶 Про цуценят'
NEWS_BUTTON_VALUE = '🗞 Новини'
OTHER_BUTTON_VALUE = '👀 Інше'

USEFUL_INFO_BUTTONS = (
    HEALT_BUTTON_VALUE,
    GOODS_FOR_DOGS_BUTTON_VALUE,
    EDUCATION_AND_LEISURE_BUTTON_VALUE,
    ABOUT_PUPPIES_BUTTON_VALUE,
    NEWS_BUTTON_VALUE,
    OTHER_BUTTON_VALUE,
    RETURN_BUTTON_VALUE,
)

MESSAGE_FIND_FRIEND_BUTTON_VALUE = "Оберіть друга і заповніть анкету 👇"

MESSAGE_HELP_SHELTER_BUTTON_VALUE = 'Дякуємо за вашу підтримку! ❤️ \
Ви можете зробити грошовий переказ \
чи привезти корм до притулку'

MESSAGE_USEFUL_INFO_BUTTON_VALUE = "Оберіть тему, яка вас цікавить 👇"

MESSAGE_ABOUT_US_BUTTON_VALUE = """Всім привіт!👋 Давайте знайомитись! \
Намагатимусь коротко розповісти нашу довгу історію 🙂\n\
\n\
В команді нашого приватного притулку всього 3 людей - я Катя Лесенко, \
моя мама Олена Лесенко  та власник притулку Владимир Чубенко,  \
людина з великої Літери ""Л"", про яку можна багато говорити.\n\
\n\
Притулок знаходиться на території, власник якої (Володимир Чубенко)  \
любить собак та спочатку просто підбирав покалічених \
і знедолених, за потреби, коли підбирав, будував наступний вол'єр. \
А я та мама волонтерили таким чином: допомогали перевезенням, \
коли потрібно, іноді брали на своє кураторство собаку,  \
лікували та прилаштовували, але це дуже складно, коли в тебе  \
немає де її перетримати та ти платиш за клініку чи \
перетримку зі своєї зарплатні, маючи родину та багато тварин вдома. \
А вдома в нас на даний момент - 4 собаки та 8 котів, \
одна з собак - вівчарка на візочку, тому особливо грошей, \
котрих і так не вистачає, не витратиш на волонтерство,  \
також пацючки, морські свинки, папужки, рибки, також маємо кобилу. \
Та одного дня Всесвіт вирішив нас познайомити між собою 🙂 \
Володимир запропонував нам перетримати у себе собаку, \
котрій ми шукали перетримку. Коли ми потрапили до притулку \
та побачили скільки там крутих собак, запропонували йому \
спробувати когось прилаштовувати, він радо погодився, \
бо раніше прилаштовував лише серед друзів та знайомих, \
але не через соц мережі. Так все й почалося та закрутилося 🙂 \
Прилаштували, на їх місце брали нових. Звичайно, \
бралося більше, ніж прилаштовувалось, бо ситуація з \
безпритульними тваринами у нас в країні така собі, \
м'яко кажучи... Так і виник притулок. Коли розрослося все \
до масштабу притулку на +- 100 собак, стало зрозуміло, \
що Володимиру складно всіх забезпечити, не говорячи вже \
про медичну допомогу.І ми почали відкривати фін збори.\n\
\n\
Згодом виникла ідея дати притулку назву й створити сторінку притулку, \
аби розкрутити її до того, щоб вона працювала як \
повноцінна платформа для прилаштування, щоб не потрібно було чекати \
черги на розміщення в інших групах та сторінках і прилаштовувати \
та знаходити допомогу швидше. Я вчуся на ветлікаря, закінчую вже. \
Мама працює бухгалтером) А по вечорам та вихідним - притулок. \
Фотосесії, обхід вольєрів, дивимося,  \
хто як почувається, зустрічі з потенційними господарями, поїздки в клініку,  \
відвозимо в нові домівки обов'язково самі, навіть, якщо це інше місто. \
Звичайно, притулок не може існувати без витрат, самостійно це все тягнути  \
вже просто не є чимось реальним, тож допомога завжди актуальна.\n\
\n\
По питанням адопції собаки чи іншим - 068 867 48 83 Катя. """

MESSAGE_CONTACTS_BUTTON_VALUE = "Наші контакти: \
Київ, Дніпровський район\n\
Номер телефону - 068 867 4883 (Катерина)\n\
Електронна адреса - shushakashusha@gmail.com"

MESSAGE_TELL_STORY_BUTTON_VALUE = 'Заповнити гугл-форму'

BUTTON_BY_TEXT_1_LVL = {
    FIND_FRIEND_BUTTON_VALUE: FIND_FRIEND_BUTTONS,
    HELP_SHELTER_BUTTON_VALUE: HELP_SHELTER_BUTTONS,
    USEFUL_INFO_BUTTON_VALUE: USEFUL_INFO_BUTTONS,
    ABOUT_US_BUTTON_VALUE: (RETURN_BUTTON_VALUE, ),
    CONTACTS_BUTTON_VALUE: (RETURN_BUTTON_VALUE, ),
    TELL_STORY_BUTTON_VALUE: (RETURN_BUTTON_VALUE, )
}

BUTTON_CLICK_MESSAGE_1_LVL = {
    FIND_FRIEND_BUTTON_VALUE: MESSAGE_FIND_FRIEND_BUTTON_VALUE,
    HELP_SHELTER_BUTTON_VALUE: MESSAGE_HELP_SHELTER_BUTTON_VALUE,
    USEFUL_INFO_BUTTON_VALUE: MESSAGE_USEFUL_INFO_BUTTON_VALUE,
    ABOUT_US_BUTTON_VALUE: MESSAGE_ABOUT_US_BUTTON_VALUE,
    CONTACTS_BUTTON_VALUE: MESSAGE_CONTACTS_BUTTON_VALUE,
    TELL_STORY_BUTTON_VALUE: MESSAGE_TELL_STORY_BUTTON_VALUE,
}
